//------------------------------------------------------------------------------
//
//ナンバー処理  [number.cpp]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "number.h"
#include "manager.h"
#include "renderer.h"
//------------------------------------------------------------------------------
//静的メンバ変数の初期化
//------------------------------------------------------------------------------
D3DXVECTOR2 CNumber::m_UVsize = D3DXVECTOR2(0.0f, 0.0f);

//------------------------------------------------------------------------------
//マクロ
//------------------------------------------------------------------------------
#define ANIMATION_TIME (8)

//------------------------------------------------------------------------------
//コンストラクタ
//------------------------------------------------------------------------------
CNumber::CNumber()
{
	m_bChangeAnimation = false;
	m_nCntAnimation = 0;
	m_DefaultSize = ZeroVector3;
}
//------------------------------------------------------------------------------
//デストラクタ
//------------------------------------------------------------------------------
CNumber::~CNumber()
{
}
//------------------------------------------------------------------------------
//初期化処理
//------------------------------------------------------------------------------
HRESULT CNumber::Init()
{
	//初期化処理
	if (FAILED(CScene2D::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//------------------------------------------------------------------------------
//更新処理
//------------------------------------------------------------------------------
void CNumber::Update()
{
	//アニメーションする時
	if (m_bChangeAnimation)
	{
		//カウンタ++
		m_nCntAnimation++;

		SetSize(m_DefaultSize + (m_DefaultSize * ((ANIMATION_TIME - m_nCntAnimation) * (1.0f / ANIMATION_TIME))));

		//アニメーションの時間に達したとき
		if (m_nCntAnimation >= ANIMATION_TIME)
		{
			m_bChangeAnimation = false;
			m_nCntAnimation = 0;
		}
	}



	//更新処理
	CScene2D::Update();
}
//------------------------------------------------------------------------------
//描画処理
//------------------------------------------------------------------------------
void CNumber::Draw()
{
	//無駄な桁数は省く
	if (GetDisp())
	{
		//描画処理
		CScene2D::Draw();
	}

}
//------------------------------------------------------------------------------
//デバッグ情報表記
//------------------------------------------------------------------------------
void CNumber::ShowDebugInfo()
{
#ifdef _DEBUG

#endif // _DEBUG

}
//------------------------------------------------------------------------------
//生成処理
//------------------------------------------------------------------------------
std::unique_ptr<CNumber> CNumber::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//メモリ確保
	std::unique_ptr<CNumber> pNumber(new CNumber);

	//nullcheck
	if (pNumber)
	{

		//テクスチャ設定
		pNumber->BindTexture(CTexture::GetSeparateTexture(CTexture::SEPARATE_TEX_UI_NUMBER));
		pNumber->SetPos(pos);
		pNumber->SetSize(size);
		pNumber->m_DefaultSize = size;

		//初期化
		pNumber->Init();
		//return
		return pNumber;
	}
	return nullptr;
}

